src/Documents/Доставка/Доставка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Доставка</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДоставок</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактныйТелефон</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Enums/СтатусыДоставок/СтатусыДоставок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДоставок</name>
  <enumValues>
    <name>Запланирован</name>
  </enumValues>
  <enumValues>
    <name>ВзятВРаботу</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненКурьером</name>
  </enumValues>
  <enumValues>
    <name>ОтклоненКлиентом</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Доставка/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ФотоНажатие(Элемент, СтандартнаяОбработка)

	#Если МобильноеПриложениеКлиент Тогда
		
	СтандартнаяОбработка = Ложь;
		
	Если СредстваМультимедиа.ПоддерживаетсяФотоснимок() Тогда
		НовоеФото = СредстваМультимедиа.СделатьФотоснимок();
		Если НовоеФото = Неопределено Тогда
			Возврат
		КонецЕсли;
		ДвоичныеДанные = НовоеФото.ПолучитьДвоичныеДанные();
		Объект.Фото = ПоместитьВоВременноеХранилище(ДвоичныеДанные, УникальныйИдентификатор);
	КОнецЕсли;
		
	#КонецЕсли

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.Статус = Перечисления.СтатусыДоставок.ОтклоненКлиентом ИЛИ
			Объект.Статус = Перечисления.СтатусыДоставок.ОтклоненКурьером Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Объект.Комментарий";
			Сообщение.Текст = "Необходимо заполнить поле комментарий";
			Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
